{
  "thinkies": [
    {
      "title": "More General Solution",
      "scenario": "You're working on an organizational effort of breaking down a large monolithic service into a set of microservices. During this transition, you receive a bug report involving multiple services, but as you investigate, you realize there's no way to correlate log messages across services.",
      "card_image": "more_general_solution.jpg",
      "insights": [
        "Collect list of 'similar' features to log messages",
        "Ask: are there other things we might need to correlate?",
        "Ask team: why is it hard to correlate log messages?\n(Hard Thinkie?)",
        "Prototype a commercial solution like Honeycomb",
        "explore open telemetry (if possible with a off-the-shelf solution)",
        "Use standards (like otel/wc3) for distributed tracing as services are called",
        "Solve the problem of distributed tracing on a module level while still on a monolith (eg, use correlation/causation ids) and make sure it will still work when moving to microservices (eg, DataDog, Zipkin, plug required libraries)",
        "Go back to a monolith",
        "Research open standards and off-the-shelf solutions.",
        "base on standards and open source component solve the problem in a subset of services (own by the same team?)",
        "If this worked we can shell the idea to the rest of the engineering org as part of the golden path",
        "Talk about the need for synchronization in general"
      ]
    },
    {
      "title": "Hard Problem",
      "scenario": "Your team is tasked with integrating an AI agent into your existing application to elevate user experience, perhaps by automating support or delivering smart, contextual recommendations powered by customer data and real-time application state. What begins as a straightforward prototype soon unfolds into a complex challenge involving security, reliability, scalability, and costly LLM models as you move toward a production-ready solution.",
      "card_image": "hard_problem.jpg",
      "insights": [
        "Can it be hacked for evil purposes?",
        "At the onset, capture 'Known Unknowns.' Update this list as 'Unknown Unknowns' are discovered",
        "Are we legally allowed to deploy generated code",
        "How/Will we limit the number of token consumed by each user?",
        "How do we make sure LLM prompts are safe",
        "LLM providers seem to run into reliability/ uptime issues",
        "LLM services might not follow the same cost reductions as other tech.",
        "Difficulty in recreating experiences with a non deterministic tool",
        "Can we do everything internally, no outside dependencies?",
        "Not much past experience to rely on",
        "It might get very expensive if the feature gets super successful",
        "How to ensure the LLM is 100% honest/correct?",
        "Oh shoots I'll need to implement an Oauth Provider to keep things secure",
        "if user demand is variable, how do we scale to accommodate",
        "Tools and patterns change daily",
        "user data privacy should be segregated from other user access",
        "How trustworthy is the AI? Can we detect when it hallucinates?",
        "How do we troubleshoot when it breaks?",
        "we haven't done this before",
        "The hype/ Expectations of an LLM that can 'respond' like a human",
        "what data is part of the context of the LLM?",
        "client hasn't approved AI usage yet",
        "How will we update the context?",
        "How do we know the AI chat is providing correct information?",
        "How do we empirically measure improvements?",
        "limited of access to infrastructure team",
        "AI messages to users must be safe guarded from unintended or inappropriate responses",
        "How to we manage LLM resource cost at scale",
        "How do we know our users are actually getting value out of this feature and is it worth the time/money?",
        "cloud services aren't offered in all regions",
        "The model is returning wrong information",
        "How do we make sure the model doesn't hallucinate?",
        "How do we ensure we protect against naughty behavior",
        "we don't know scalability needs yet, so pricing is difficult",
        "How can a user tell us that the AI chat gave them incorrect information",
        "protected user data",
        "Copyright laws? (legal issues)",
        "Externalized costs - power usage, water usage, etc",
        "Prompt exploits make it hard to offer too many features safely",
        "Mismatch between capability and expectations",
        "Protecting user data if relying on external model",
        "Analytics might be difficult to make useful"
      ]
    },
    {
      "title": "Direct Feedback",
      "scenario": "Three years ago you created a great little web app at your company. Being a good person, you kept the data model and API open, and others built on it. Now, millions of people are consuming your app via third party extensions.  The sales and marketing teams are now selling your app.  The customer support team is responding to calls.  Every once in a while, you get a report about the sales figures or the net promoter score, but you really don't know what features people are depending on, or what people value the most, so you don't know what to prioritize on your roadmap. What do you do?",
      "card_image": "direct_feedback.jpg",
      "insights": [
        "Go to your user conferences and trade shows and user groups. Hang out incognito.",
        "Add something to the app that invites users to come and talk to you.",
        "Form a hypothesis about what users want. Instrument your code to observe users directly, run an experiment, and gather data to test your hypothesis.",
        "Add a widget to receive direct feedback from a user",
        "Add analytics tools to get automotive feedback",
        "Improve observability",
        "Find the smallest path to a user through company heirarchy\n\n\n(first line support)",
        "Find allies who need direct user feedback\n\n\n(look for direct feedback demand)",
        "Ask other teams how they work with user feedback",
        "Create user community\nlike a thread on reddit",
        "Create slack workspace for technical users",
        "Find out online or offline events for users",
        "Create  a feedback loop to show that direct feedback creates better result",
        "If you can't get all the way to the source, can you at least get closer? Eliminate one layer.",
        "Are you afraid to ask for feedback?",
        "Incentivize direct feedback with a small reward",
        "Do continuously small improvements",
        "Improve app quality to make changes easy\n(react to feedback faster)",
        "Update users about progress for their feedback\n(even share road map)",
        "Analyze why we have multi-layer feedback\n(can we reduce it)"
      ]
    },
    {
      "title": "Analogy",
      "scenario": "Your company has a daily batch process for sending notifications. Business has been booming, and that batch process now overwhelms the notifications system. You recommend changing the process to a message queue to handle the new volume. The manager doesn't understand how that will help; instead, focusing on improving the performance of the code. How do you explain your recommendation?",
      "card_image": "analogy.jpg",
      "insights": [
        "ChatGPT: Imagine you run a restaurant that serves 100 customers a day. You take everyone's order at 6 PM, then try to cook and serve all 100 meals at once. That worked when you had only 20 customers—it was a rush, but manageable. Now, it's chaos. The kitchen gets overwhelmed, the servers are backed up, and everyone's waiting. You can try to speed up cooking a little, but it won't solve the real problem.'\n'Now imagine instead you switch to a buffet. As each dish is ready, it goes out on the line, and customers serve themselves when they're ready. The kitchen keeps cooking steadily, and the load is spread out. No traffic jams, no bottlenecks.'\n'Right now, our system is the restaurant doing a big nightly rush—it overwhelms the notifications system. Moving to a message queue is like setting up the buffet. We smooth out the workload, letting the system handle each notification when it's ready, instead of flooding it all at once.",
        "The experience of the restaurant is known by most people",
        "job is getting too big is like the potato bag getting to large",
        "Explain that implementing a message queue is like organizing work on a restaurant: by separating  the order emission (waiters) from the order processing (cooks), we can increase our capacity for taking orders, while keeping quality high",
        "Imagine you need to peel a lot of potatoes. You could put them all in one bag and haul them over to where you need to work, but eventually your bag isn't big enough. Better to have a conveyer belt bring you the potatoes one by one",
        "In constrained places like a cafe where someone does multiple roles you can experience the bottle neck"
      ]
    },
    {
      "title": "Put Skin in the Game",
      "scenario": "Sales is approaching customers and selling contracts for new features as if they already exist, clogging Software Engineering's (SWE) backlog and interrupting developers' flow and plummeting their morale.\n\n\nDespite the feedback about how this is affecting us (SWE), sales keeps on selling nonexistent features and complaining they're not existing. What do we do?",
      "card_image": "put_skin_in_the_game.jpg",
      "insights": [
        "Leaderboard of 'emergency features led to $X of sales'",
        "Share sales commissions with the programmers",
        "Timeline on wall depicting expected delivery dates of each feature (new features go at the end)",
        "Add sales people to the weekly planning",
        "WSJF - what can we get out the door quickest",
        "Visual board of unimplemented features (backlog)",
        "Right now, sales is able to get their work prioritized based on the pressure associated with having to fill contracts. Make sales sign corresponding contracts with SWE",
        "Role Swap or 'Day in the Life' Exchange",
        "Hold Commissions or Tie to Roadmap Adherence",
        "Customer satisfaction survey when feature isn't delivered on salesman schedule",
        "how do we get sales people to experience reduced optionality?",
        "Fire that salesman (it's usually a guy, right?)",
        "Limit backlog. Have to remove something to add somerthing",
        "Tie sales people bonus to a 'clean sales' metric, that is, sales made under a process with consent from all parties, SWE, sales, marketing, etc.",
        "Ordering of requested features displayed and tied to sales timeline",
        "Tie sales success to feature delivery",
        "Add SWE to sales team visits",
        "Give each salesperson dot votes on backlog items. Make it clear that backlog items will be prioritized accordingly; when you're out of dot votes, too bad.",
        "Maybe, consider that SWE is facing 'skin in the game': they're not communicating well with sales, and now are facing the consequences of that"
      ]
    },
    {
      "title": "End to End",
      "scenario": "You got hired to build a personal finance app that needs to work in Brazil, Mexico, and Spain. The company already brought in tax experts for each country, designers who understand local cultures, localization specialists, security folks, and data analysts for reports. Everyone wants to start 'properly' by building the architecture first, then security, then localization... But the CEO wants to see something working in 8 weeks to show investors.",
      "card_image": "end_to_end.jpg",
      "insights": [
        "Build a walking skeleton with a single feature or small set of features for a single country (choose the one with highest potential GMV). Make sure there is CI/CD baked in from day 1 so the app is always in a deployable state and could be presented in 8 weeks",
        "This minimize waste since we have a small timeframe =>",
        "ignore security - it's a demo for investors",
        "Build whole thing for Brazil",
        "steel thread",
        "Use the Force Decision Thinkie =>",
        "add a new data source",
        "add an additional region for the first report",
        "work backwards from a single report (or other slice) in a single region",
        "Build 1report for Brazil",
        "Which report?",
        "Thinkie: The easy bit?",
        "Thinkie: The fun bit?",
        "Which report would help us to learn more?",
        "Do we need to learn more about the business?",
        "Do we need to learn more about the technical part?",
        "Thinkie: Talk directly to the customers",
        "Maybe start with CI, and then go to CD (only if necessary)"
      ]
    },
    {
      "title": "Easy Bit",
      "scenario": "You're on a small team at a payments company, and you've been tasked with building a new reconciliation system to track the flow of millions of dollars across countless transactions. There's a whiteboard full of architecture diagrams related to flow of funds, and payments providers.  There's some proof of concept code.  You know the system will eventually need API integrations with all external partners, data models to link the payments together, and robust reporting, but that all feels a million miles away. Where do you start?",
      "card_image": "easy_bit.jpg",
      "insights": [
        "Make a spreadsheet of all of the sources of data / money movement",
        "Grab some example payloads and start working on the core data model linking payments together",
        "Pick a provider and start a flow with the proof of concept as a starting point",
        "Start to build API wrappers to pull in tx details from providers",
        "Test existing proof of concept code, make a list of what gaps currently exist with it",
        "Make a list of funds flows",
        "Build 1 API integration",
        "Randomly select some transactions and explain them in human language"
      ]
    },
    {
      "title": "Can't / Because",
      "scenario": "It is your first week at a new workplace.\nYou were given a small user story to work on and are ready to release to production! Your teammate then tells you:\n'Great work on finishing your first ticket before the end of your first week! But we can't deploy today because something might break over the weekend.'",
      "card_image": "cant_because.jpg",
      "insights": [
        "When we are sure things, won't break, we can deploy anytime",
        "if we are sure things won't break, we can deploy at any time",
        "When somebody doesn't want to work on something, their 'because' statement is unbelivable",
        "Why dont we know if we will break something? can we find out today?",
        "If we can rollback quickly we can deploy any time",
        "If we have on call rotations with enough knowledge about the feature we can deploy at any time",
        "If we have automatic rollback (business metrics) we can deploy",
        "Prepare a easy to use rollback. so that if it breaks we can roll it back and deal with it next week",
        "When we can rollback easily, we can deploy anytime",
        "When we understand the risk, we can deploy anytime.",
        "When we have availability respond, to  can deploy anytime.",
        "We can't do this work, because we don't have enough people",
        "When we have enough people, we can do this work.",
        "When we have availability, we can take on new work.",
        "We can't use TBD / CD because of the iso27001/SOC2 cert require several engineers reviewing each change",
        "If we do pairing and we sign the commit with both author we can use TBD / CD"
      ]
    },
    {
      "title": "Force Decision",
      "scenario": "You're working on a cost-cutting modernization project, but the tech stack is showing its age:\n\n • Build tools: Legacy versions that slow development\n • Version control: Outdated and hard to integrate with modern pipelines\n • Operating system: Windows, which must be migrated to Linux\n\nAll three components need to be replaced. The team is hesitating to make a decision on the the new tools, platforms, and in which order, then no decision has been made yet.",
      "card_image": "force_decision.jpg",
      "insights": [
        "Suggest to keep everything as it is. No action is an action.",
        "Make a comparison table of possible solutions.",
        "Containerize",
        "Do we have the knowledge to start using modern pipelines today? If not, we should skip version control for now.",
        "Is there any dependencies between the build tools and the operating system? Would we need to update the build tools again if we change the operating system?",
        "Seems like both the build tools and the version control are somewhat dependent on the Operating System, so maybe we should start there?",
        "Agree on the problems first rather than proposing a solution.",
        "Introduce corporate policy enforced through MDM profile.",
        "Deprecation: Shutting down existing services with graceful period.",
        "Or maybe start with it, and train the team"
      ]
    },
    {
      "title": "Half in a Half",
      "scenario": "Our team owns an internal tool that is an extension to a SaaS developer tool, integrating 4 internal services to supply 2 specific developer workflows. The agreement with the current vendor ends in 4 months, and so we have to migrate the tools implementation and all users over to the new vendor by that deadline to avoid significant costs. We estimate we need 6 months of time to complete the migration of all integrations and users. How can we make the deadline?",
      "card_image": "half_in_a_half.jpg",
      "insights": [
        "1/2 Scope",
        "Which half of the internal services don't need to be migrate (EOL)",
        "Which half of the users won't be migrated?",
        "Usage logs",
        "Usage logs",
        "Which Work Flow or parts of workflows",
        "Usage logs",
        "'Brown out' who hollers the loudest?",
        "'Brown out' who hollers the loudest?",
        "'Brown out' who hollers the loudest?",
        "1/2 Time",
        "Which half can be automated...",
        "Repeatable patterns for migration",
        "Ask folks about what's 'most important integration?'",
        "1/2 Costs",
        "What's the most expensive 'overage'?",
        "What half can we afford to pay for past deadline",
        "I've done that.  Turn it off!",
        "Turns out integration used by one person :)"
      ]
    },
    {
      "title": "Obviously",
      "scenario": "Your team is modernizing a legacy application. In a planning meeting, a key stakeholder says, 'Obviously, we need Feature X integrated into the new platform for the initial launch, as it's critical for our biggest client.' What do you do?",
      "card_image": "obviously.jpg",
      "insights": [
        "Do more of our clients have a different 'critical' feature",
        "Is the feature X part of the new flow?",
        "Does the mvp requires it for launch?",
        "Can we make it smaller?",
        "Will our biggest client use the new platform?",
        "Ask what happens for the remaining clients",
        "Question if another feature might provide more value",
        "They don't need it for launch....",
        "They don't need it at all",
        "Obvious we need to talk directly with the biggest client",
        "Launch earlier to clients who don't need this critical feature",
        "Do we know why this is critical for our biggest client likes this?",
        "Could we increase product focus on other customers so we aren't so reliant on one?",
        "What's the current usage rate of feature X?",
        "The effort to recreate this feature sounds like it would be Y weeks, are we willing to delay launch by that or sacrifice other features?",
        "Are we reimplementing the platform, or taking the chance to re-haul the solution?",
        "Should we run through some of the other requirements before we decide this is an obvious feature to include?",
        "Guestimate Cost of Delay",
        "Put it into legacy... as a dead end, track clicks on feature...",
        "Obvious the stakeholder's annual bonus is tied to the launch of feature x!!!",
        "Does it make sense in new platform?",
        "Share current UX/UI low fidelity of new platform",
        "How does the cost to build/maintain feature X vs the revenue generated by biggest client"
      ]
    },
    {
      "title": "Fun Bit",
      "scenario": "You've been assigned to a new project to modernize a legacy Java application, that hasn't been in active development for many years. The organization has plans for new features that will require changes to the app, and wants to resume active development.  The manager for the project is unsure of the current state of the application, and most of the original developers of the application have since left the company.  Where do you start?",
      "card_image": "fun_bit.jpg",
      "insights": [
        "Talk with business about wishes",
        "Find the app in production",
        "exploratory testing",
        "Run the app",
        "coding in \nflow is fun!",
        "improve flow with tests and observability",
        "is there anything we can do to make the legacy code more fun?",
        "building new features is fun!",
        "write and run 1 test",
        "ask team to describe what work is fun for them",
        "split into solos or small groups, do something fun (related to the project) for an hour, then share",
        "make small groups, brainstorm 'fun' small tasks",
        "Create a new branch and let's start to break components",
        "Explore the repo, read the PR merged, comments, etc... see the commit graphs",
        "setup pipeline",
        "Implement any change",
        "Find old team on linkedin. Offer a lumch",
        "Setup dev environment",
        "Run tests if they exist",
        "smallest possible change",
        "Make prototype for new feature requests in a separate app to gather feedback from business",
        "build/run the app on a dev box",
        "apply 'easy bit' Thinkie!"
      ]
    },
    {
      "title": "Thinkies Board",
      "scenario": "You've been assigned to a new project to modernize a legacy Java application, that hasn't been in active development for many years.  The organization has plans for new features that will require changes to the app, and wants to resume active development.  The manager for the project is unsure of the current state of the application, and most of the original developers of the application have since left the company.  Where do you start?",
      "card_image": "thinkies_board.jpg",
      "insights": [
        "I am a test coverage nerd. The fun bit for me is to measure test coverage and see where our biggest meaningful gaps are!",
        "Scan the sprint backlog for the juiciest looking bug and dive in so I can gain familiarity.",
        "Java!! I love Java.  Let me fire up that sweet sweet Java mem profiler...",
        "Dive right in to the codebase and start figuring out the architecture and drawing pictures",
        "Find out if there's any other developers that have worked on the app and start collecting legacy horror stories"
      ]
    }
  ],
  "exported_at": "2025-11-26T09:39:09.079070Z",
  "total_count": 13
}